app/views/eqas/_form.html.erb

    Test Name<br />
 <%= select("eqa", "test_code_id", TestCode.all.collect {|p| [ p.testExpansion, p.id ] }, {:include_blank => 'None'}) %>
---
SELECT "test_codes".* FROM "test_codes"

    <%= f.label :scheme %><br />
<%= select("eqa", "eqa_scheme_id", EqaScheme.all.collect {|p| [ p.name, p.id ] }, {:include_blank => 'None'}) %>
---
SELECT "eqa_schemes".* FROM "eqa_schemes"