app/views/iqc_data/_form.html.erb

SELECT "test_codes".* FROM "test_codes"
---
  <div class="field">Test Name:
  <%= select("iqc_datum", "test_code_id", TestCode.all.collect {|p| [ p.testExpansion, p.id ] }, {:include_blank => 'None'}) %>

SELECT "iqcs".* FROM "iqcs"
---
  <div class="field">IQC Material:
  <%= select("iqc_datum", "iqc_id", Iqc.all.collect {|p| [ p.name, p.id ] }, {:include_blank => 'None'}) %>

SELECT "analysers".* FROM "analysers"
---
  <div class="field">Analyser:
  <%= select("iqc_datum", "analyser_id", Analyser.all.collect {|p| [ p.AnalyserName, p.id ] }, {:include_blank => 'None'}) %>