app/views/home/index.html.erb

SELECT "test_codes".* FROM "test_codes"
---
		<fieldset>
		<%=select("test_code_id", "id", TestCode.all.collect {|p| [ p.testExpansion, p.id ] }, {:prompt => 'Select Test'}) %>