app/views/quality_specifications/_form.html.erb

SELECT "test_codes".* FROM "test_codes"
---

<%= select("quality_specification", "test_code_id", TestCode.all.collect {|p| [ p.testExpansion, p.id ] }, {:include_blank => 'None'}) %>