app/views/quality_specifications/index.html.erb

SELECT "test_codes".* FROM "test_codes" WHERE "test_codes"."id" = ? LIMIT 1  [["id", 3]]
---
<%
linktestCode = TestCode.find(quality_specification.test_code_id)