app/views/quality_specifications/show.html.erb

<%
linktestCode = TestCode.find(@quality_specification.test_code_id)
---
SELECT "test_codes".* FROM "test_codes" WHERE "test_codes"."id" = ? LIMIT 1  [["id", 3]]