app/controllers/analysers_controller.rb

SELECT "analysers".* FROM "analysers"
---
  def index
    @analysers = Analyser.all

SELECT "analysers".* FROM "analysers" WHERE "analysers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @analysers = Analyser.find(params[:id])

SELECT "analysers".* FROM "analysers" WHERE "analysers"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @analysers = Analyser.find(params[:id])

INSERT INTO "analysers" ("AnalyserLocation", "AnalyserName", "AnalyserNote", "created_at", "iqc_data_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @analysers = Analyser.new(params[:analyser])

    respond_to do |format|
      if @analysers.save

SELECT "analysers".* FROM "analysers" WHERE "analysers"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "analysers" SET "AnalyserName" = 'Abbott', "AnalyserNote" = 'Test', "AnalyserLocation" = 'Main Lab', "updated_at" = '2012-12-28 13:46:29.009134' WHERE "analysers"."id" = 3
---
  def update
    @analysers = Analyser.find(params[:id])

    respond_to do |format|
      if @analysers.update_attributes(params[:analyser])

SELECT "analysers".* FROM "analysers" WHERE "analysers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "analysers" WHERE "analysers"."id" = ?  [["id", 1]]
---
  def destroy
    @analysers = Analyser.find(params[:id])
    @analysers.destroy