app/controllers/eqa_schemes_controller.rb

SELECT "eqa_schemes".* FROM "eqa_schemes"
---
  def index
    @eqa_schemes = EqaScheme.all

SELECT "eqa_schemes".* FROM "eqa_schemes" WHERE "eqa_schemes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @eqa_scheme = EqaScheme.find(params[:id])

INSERT INTO "eqa_schemes" ("address", "contact", "created_at", "name", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?)  [["address", "Birmingham"], ["contact", ""], ["created_at", Fri, 28 Dec 2012 16:12:36 UTC +00:00], ["name", "NEQAS"], ["updated_at", Fri, 28 Dec 2012 16:12:36 UTC +00:00], ["website", ""]]
---
  def create
    @eqa_scheme = EqaScheme.new(params[:eqa_scheme])

    respond_to do |format|
      if @eqa_scheme.save