app/controllers/eqas_controller.rb

SELECT "eqas".* FROM "eqas"
---
  def index
    @eqas = Eqa.all

SELECT "eqas".* FROM "eqas" WHERE "eqas"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @eqa = Eqa.find(params[:id])

SELECT "eqas".* FROM "eqas" WHERE "eqas"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @eqa = Eqa.find(params[:id])

INSERT INTO "eqas" ("bias", "created_at", "eqa_scheme_id", "notes", "test_code_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["bias", 12.0], ["created_at", Fri, 28 Dec 2012 16:13:16 UTC +00:00], ["eqa_scheme_id", 1], ["notes", "Testing"], ["test_code_id", 3], ["updated_at", Fri, 28 Dec 2012 16:13:16 UTC +00:00]]
---
  def create
    @eqa = Eqa.new(params[:eqa])

    respond_to do |format|
      if @eqa.save

SELECT "eqas".* FROM "eqas" WHERE "eqas"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "eqas" SET "notes" = 'Testing', "updated_at" = '2012-12-28 16:19:21.157736' WHERE "eqas"."id" = 1
---
  def update
    @eqa = Eqa.find(params[:id])

    respond_to do |format|
      if @eqa.update_attributes(params[:eqa])