app/controllers/home_controller.rb

  def index

    @test_codes = TestCode.all
---
SELECT "test_codes".* FROM "test_codes"