app/controllers/iqcs_controller.rb

  def index
    @iqc = Iqc.all
---
SELECT "iqcs".* FROM "iqcs"

  def show
    @iqc = Iqc.find(params[:id])
---
SELECT "iqcs".* FROM "iqcs" WHERE "iqcs"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @iqc = Iqc.new
    @test_codes = TestCode.all
---
SELECT "test_codes".* FROM "test_codes"

  def edit
    @iqc = Iqc.find(params[:id])
---
SELECT "iqcs".* FROM "iqcs" WHERE "iqcs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @iqc = Iqc.new(params[:iqc])

    respond_to do |format|
      if @iqc.save
---
INSERT INTO "iqcs" ("IQCID", "assigned", "created_at", "dateTimeCreated", "manufacturer", "name", "notes", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @iqc = Iqc.find(params[:id])

    respond_to do |format|
      if @iqc.update_attributes(params[:iqc])
---
SELECT "iqcs".* FROM "iqcs" WHERE "iqcs"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "iqcs" SET "assigned" = 'f', "updated_at" = '2012-12-28 12:11:38.965229' WHERE "iqcs"."id" = 1