app/controllers/quality_specifications_controller.rb

SELECT "quality_specifications".* FROM "quality_specifications"
---
  def index
    @quality_specifications = QualitySpecification.all

SELECT "quality_specifications".* FROM "quality_specifications" WHERE "quality_specifications"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @quality_specification = QualitySpecification.find(params[:id])

SELECT "quality_specifications".* FROM "quality_specifications" WHERE "quality_specifications"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @quality_specification = QualitySpecification.find(params[:id])

INSERT INTO "quality_specifications" ("bias", "created_at", "imprecision", "testCode", "test_code_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["bias", 10.0], ["created_at", Tue, 11 Dec 2012 16:45:01 UTC +00:00], ["imprecision", 10.0], ["testCode", nil], ["test_code_id", nil], ["updated_at", Tue, 11 Dec 2012 16:45:01 UTC +00:00]]
---
  def create
    @quality_specification = QualitySpecification.new(params[:quality_specification])

    respond_to do |format|
      if @quality_specification.save

SELECT "quality_specifications".* FROM "quality_specifications" WHERE "quality_specifications"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "quality_specifications" SET "imprecision" = 11.0, "updated_at" = '2012-12-24 15:39:42.062936' WHERE "quality_specifications"."id" = 12
---
  def update
    @quality_specification = QualitySpecification.find(params[:id])

    respond_to do |format|
      if @quality_specification.update_attributes(params[:quality_specification])

SELECT "quality_specifications".* FROM "quality_specifications" WHERE "quality_specifications"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "quality_specifications" WHERE "quality_specifications"."id" = ?  [["id", 1]]
---
  def destroy
    @quality_specification = QualitySpecification.find(params[:id])
    @quality_specification.destroy