app/controllers/sigmas_controller.rb

  def index
    @sigmas = Sigma.all
---
SELECT "sigmas".* FROM "sigmas"