app/controllers/targets_controller.rb

SELECT "targets".* FROM "targets"
---
  def index
    @targets = Target.all