app/controllers/test_codes_controller.rb

SELECT "test_codes".* FROM "test_codes"
---
  def index
    @test_codes = TestCode.all

SELECT "test_codes".* FROM "test_codes" WHERE "test_codes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @test_code = TestCode.find(params[:id])

SELECT "test_codes".* FROM "test_codes" WHERE "test_codes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @test_code = TestCode.find(params[:id])

INSERT INTO "test_codes" ("active", "created_at", "notes", "testCode", "testExpansion", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["active", false], ["created_at", Mon, 10 Dec 2012 12:18:14 UTC +00:00], ["notes", ""], ["testCode", "ALB"], ["testExpansion", "Albumin"], ["updated_at", Mon, 10 Dec 2012 12:18:14 UTC +00:00]]
---
  def create
    @test_code = TestCode.new(params[:test_code])

    respond_to do |format|
      if @test_code.save

SELECT "test_codes".* FROM "test_codes" WHERE "test_codes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "test_codes" SET "testCode" = 1, "testCodeText" = 'ALB', "testExpansion" = 'Albumin', "notes" = 'Test', "active" = 't', "updated_at" = '2012-12-11 11:56:21.744187' WHERE "test_codes"."id" = 3
---
  def update
    @test_code = TestCode.find(params[:id])

    respond_to do |format|
      if @test_code.update_attributes(params[:test_code])

SELECT "test_codes".* FROM "test_codes" WHERE "test_codes"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "test_codes" WHERE "test_codes"."id" = ?  [["id", 2]]
---
  def destroy
    @test_code = TestCode.find(params[:id])
    @test_code.destroy