app/views/common/_analyser.html.erb

SELECT "analysers".* FROM "analysers" WHERE "analysers"."id" = ? LIMIT 1  [["id", 1]]
---
<%analyser = Analyser.find(object)%>