app/views/common/_eqascheme.html.erb

SELECT "eqa_schemes".* FROM "eqa_schemes" WHERE "eqa_schemes"."id" = ? LIMIT 1  [["id", 1]]
---
<%eqa = EqaScheme.find(object)%>