app/views/common/_iqcmaterial.html.erb

SELECT "iqcs".* FROM "iqcs" WHERE "iqcs"."id" = ? LIMIT 1  [["id", 1]]
---
<%iqc = Iqc.find(object)%>