app/views/common/_test_code_id.html.erb

SELECT "test_codes".* FROM "test_codes" WHERE "test_codes"."id" = ? LIMIT 1  [["id", 3]]
---
<%linktestCode = TestCode.find(object)%>